---
kind: property
id: P:Autodesk.Revit.DB.ExportFontInfo.IsValidObject
source: html/c26ba64b-41d2-9d87-8a53-19eca8b58d06.htm
---
# Autodesk.Revit.DB.ExportFontInfo.IsValidObject Property

Specifies whether the .NET object represents a valid Revit entity.

## Syntax (C#)
```csharp
public bool IsValidObject { get; }
```

## Returns
True if the API object holds a valid Revit native object, false otherwise.

## Remarks
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
 a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.